src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВнешнийНомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакБессрочногоДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Договоры/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ПризнакБессрочногоДоговора Тогда
		Элементы.ДатаОкончанияДоговора.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
			Объект.ДатаОкончанияДоговора = '0001,01,01';
		КонецЕсли;
	Иначе
		Элементы.ДатаОкончанияДоговора.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПризнакБессрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	ДатаЗаключенияДоговораБезВремени = Формат(Объект.ДатаЗаключенияДоговора, "ДФ='dd.MM.yyyy'");
	
	Если ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора + " от " + ДатаЗаключенияДоговораБезВремени + " г.";
	ИначеЕсли ЗначениеЗаполнено(Объект.ВнешнийНомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийНомерДоговора;
	Иначе
		Объект.Наименование = " от " + ДатаЗаключенияДоговораБезВремени + " г.";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийНомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

#КонецОбласти
